DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. We can think of it like a spreadsheet or SQL table. It is generally the most commonly used pandas object.

Here, I'm working with
more advanced features of DataFrame like
sorting data, answering analytical questions
using the data, cleaning data and applying
different useful functions on the data.

 **Store the Result data in a DataFrame called StudentMarks.**

In [1037]:
import pandas as pd
StudentMarks= {
    'Name':['Suci','Suci','Suci','Srabanti','Srabanti','Srabanti', 'Ashravy','Ashravy','Ashravy','Mishti','Mishti','Mishti'],
 'UnitTest':[1,2,3,1,2,3,1,2,3,1,2,3],
 'DataMining':[22,21,14,20,23,22,23,24,12,15,18,17],
 'AI':[21,20,19,17,15,18,19,22,25,22,21,18],
 'Graphics':[18,17,15,22,21,19,20,24,19,25,25,20],
 'ImageProcessing':[20,22,24,24,25,23,15,17,21,22,24,25],
 'Cryptography':[21,24,23,19,15,13,22,21,23,22,23,20]
 }

In [1038]:
MarksInformation=pd.DataFrame(StudentMarks)
MarksInformation

,Name,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
0,Suci,1,22,21,18,20,21
1,Suci,2,21,20,17,22,24
2,Suci,3,14,19,15,24,23
3,Srabanti,1,20,17,22,24,19
4,Srabanti,2,23,15,21,25,15
5,Srabanti,3,22,18,19,23,13
6,Ashravy,1,23,19,20,15,22
7,Ashravy,2,24,22,24,17,21
8,Ashravy,3,12,25,19,21,23
9,Mishti,1,15,22,25,22,22
10,Mishti,2,18,21,25,24,23
11,Mishti,3,17,18,20,25,20

**Calculating Maximum Values**

In [1039]:
 print(MarksInformation.max())

Name               Suci
UnitTest              3
DataMining           24
AI                   25
Graphics             25
ImageProcessing      25
Cryptography         24
dtype: object

**If we want to output maximum value for the columns
having only numeric values, then we can set the
parameter numeric_only=True in the max() method, as
shown below:**

In [1040]:
 print(MarksInformation.max(numeric_only=True))

UnitTest            3
DataMining         24
AI                 25
Graphics           25
ImageProcessing    25
Cryptography       24
dtype: int64

**Write the statements to output the maximum marks obtained in each subject in Unit Test 2.**

In [1041]:
UnitTest2 = MarksInformation[MarksInformation.UnitTest == 2]
print(f'\nResult of Unit Test 2:\n\n')
UnitTest2

Result of Unit Test 2:

,Name,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
1,Suci,2,21,20,17,22,24
4,Srabanti,2,23,15,21,25,15
7,Ashravy,2,24,22,24,17,21
10,Mishti,2,18,21,25,24,23

In [1042]:
print(f'\nMaximum Mark obtained in Each Subject in Unit Test 2: \n\n{UnitTest2.max(numeric_only=True)}')

Maximum Mark obtained in Each Subject in Unit Test 2:

UnitTest            2
DataMining         24
AI                 22
Graphics           25
ImageProcessing    25
Cryptography       24
dtype: int64

By default, the max() method finds the maximum
value of each column (which means, axis=0). However,
to find the maximum value of each row, we have to
specify axis = 1 as its argument.

**maximum marks for each student in each unit test among all the subjects**

In [1043]:
 MarksInformation.max(numeric_only=True,axis=1)

0     22
1     24
2     24
3     24
4     25
5     23
6     23
7     24
8     25
9     25
10    25
11    25
dtype: int64

**Calculating Minimum Values**

In [1044]:
 print( MarksInformation.min(numeric_only=True))

UnitTest            1
DataMining         12
AI                 15
Graphics           15
ImageProcessing    15
Cryptography       13
dtype: int64

In [1045]:
MarksInformation.min()

Name               Ashravy
UnitTest                 1
DataMining              12
AI                      15
Graphics                15
ImageProcessing         15
Cryptography            13
dtype: object

Write the statements to display the
minimum marks obtained by a particular
student ‘Suci’ in all the unit tests for
each subject.

In [1046]:
marksSuci = MarksInformation.loc[MarksInformation.Name == 'Suci']
print(f'\nMarks obtained by Suci in all the Unit Tests \n\n')
marksSuci

Marks obtained by Suci in all the Unit Tests

   Name  UnitTest  DataMining  AI  Graphics  ImageProcessing  Cryptography
0  Suci         1          22  21        18               20            21
1  Suci         2          21  20        17               22            24
2  Suci         3          14  19        15               24            23

In [1047]:
print(f'\nMinimum Marks obtained by Suci in each subject across the unittests\n\n{marksSuci[['DataMining','AI','Graphics','ImageProcessing','Cryptography']].min()}')

Minimum Marks obtained by Suci in each subject across the unittests

DataMining         14
AI                 19
Graphics           15
ImageProcessing    20
Cryptography       21
dtype: int64

**Calculating Sum of Values**

DataFrame.sum() will display the sum of the values
from the DataFrame regardless of its datatype. The
following line of code outputs the sum of each column
of the DataFrame:

In [1048]:
 print(MarksInformation.sum())

Name               SuciSuciSuciSrabantiSrabantiSrabantiAshravyAsh...
UnitTest                                                          24
DataMining                                                       231
AI                                                               237
Graphics                                                         245
ImageProcessing                                                  262
Cryptography                                                     246
dtype: object

In [1049]:
print(MarksInformation.sum(numeric_only=True))

UnitTest            24
DataMining         231
AI                 237
Graphics           245
ImageProcessing    262
Cryptography       246
dtype: int64

To print the sum of a particular column, we need to specify the column name in the call to function sum.
The following statement prints the total marks of
subject mathematics:

In [1050]:
print(MarksInformation['DataMining'].sum())

231

**Write the python statement to print
the total marks secured by Suci in
each subject.**

In [1051]:
marksRaman=MarksInformation[MarksInformation['Name']=='Suci']
print(f"\nMarks obtained by Suci in each test are:\n\n{marksRaman}")

Marks obtained by Suci in each test are:

   Name  UnitTest  DataMining  AI  Graphics  ImageProcessing  Cryptography
0  Suci         1          22  21        18               20            21
1  Suci         2          21  20        17               22            24
2  Suci         3          14  19        15               24            23

In [1052]:
marksRaman[['DataMining','AI','Graphics','ImageProcessing','Cryptography']].sum()

DataMining         57
AI                 60
Graphics           50
ImageProcessing    66
Cryptography       68
dtype: int64

To print total marks scored by Suci in all
subjects in each Unit Test

In [1053]:
 marksSuci[['DataMining','AI','Graphics','ImageProcessing','Cryptography']].sum(axis=1)

0    102
1    104
2     95
dtype: int64

**Calculating Number of Values**

DataFrame.count() will display the total number of
values for each column or row of a DataFrame. To count
the rows we need to use the argument axis=1 as shown
in the Program  below.

In [1054]:
 print(MarksInformation.count())

Name               12
UnitTest           12
DataMining         12
AI                 12
Graphics           12
ImageProcessing    12
Cryptography       12
dtype: int64

Write a statement to count the number of
values in a row.

In [1055]:
MarksInformation.count(axis=1)

0     7
1     7
2     7
3     7
4     7
5     7
6     7
7     7
8     7
9     7
10    7
11    7
dtype: int64

**Calculating Mean**

DataFrame.mean() will display the mean (average) of
the values of each column of a DataFrame. It is only
applicable for numeric values.

In [1056]:
MarksInformation.mean(numeric_only=True)

UnitTest            2.000000
DataMining         19.250000
AI                 19.750000
Graphics           20.416667
ImageProcessing    21.833333
Cryptography       20.500000
dtype: float64

Write the statements to get an average
of marks obtained by Suci in all the
Unit Tests.

In [1057]:
MarksInformation

,Name,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
0,Suci,1,22,21,18,20,21
1,Suci,2,21,20,17,22,24
2,Suci,3,14,19,15,24,23
3,Srabanti,1,20,17,22,24,19
4,Srabanti,2,23,15,21,25,15
5,Srabanti,3,22,18,19,23,13
6,Ashravy,1,23,19,20,15,22
7,Ashravy,2,24,22,24,17,21
8,Ashravy,3,12,25,19,21,23
9,Mishti,1,15,22,25,22,22
10,Mishti,2,18,21,25,24,23
11,Mishti,3,17,18,20,25,20

In [1058]:
Suci=MarksInformation[MarksInformation['Name']=='Suci']
SuciMarks =Suci.loc[:,'DataMining':'Cryptography']
print("\n\nSlicing of the DataFrame to get only the marks\n\n")
SuciMarks

Slicing of the DataFrame to get only the marks

   DataMining  AI  Graphics  ImageProcessing  Cryptography
0          22  21        18               20            21
1          21  20        17               22            24
2          14  19        15               24            23

Average of marks obtained by Zuhaire in all Unit Tests

Average of marks obtained by Suci in all Unit Tests

In [1059]:
SuciMarks.mean(axis=1)

0    20.4
1    20.8
2    19.0
dtype: float64

**Calculating Median**

DataFrame.Median() will display the middle value of the
data. This function will display the median of the values
of each column of a DataFrame. It is only applicable for
numeric values.

In [1060]:
 print(MarksInformation.median(numeric_only=True))

UnitTest            2.0
DataMining         20.5
AI                 19.5
Graphics           20.0
ImageProcessing    22.5
Cryptography       21.5
dtype: float64

Write the statements to print the median
marks of mathematics

In [1061]:
DataMining=MarksInformation['DataMining']

In [1062]:
DataMining

0     22
1     21
2     14
3     20
4     23
5     22
6     23
7     24
8     12
9     15
10    18
11    17
Name: DataMining, dtype: int64

In [1063]:
DataMining1=DataMining[MarksInformation.UnitTest==1]
print("Displaying the marks scored in DataMining in UnitTest-1")
DataMining1

Displaying the marks scored in DataMining in UnitTest-1

0    22
3    20
6    23
9    15
Name: DataMining, dtype: int64

In [1064]:
DataMiningMedian=DataMining1.median()
print("Displaying the median of Mathematics in UnitTest-1\n",DataMiningMedian)

Displaying the median of Mathematics in UnitTest-1
 21.0

Here, the number of values are even in number
so two middle values are there i.e. 20 and 22. Hence,
Median is the average of 20 and 22.

**Calculating Mode**

DateFrame.mode() will display the mode. The mode is
defined as the value that appears the most number of
times in a data. This function will display the mode of
each column or row of the DataFrame. To get the mode
of Hindi marks, the following statement can be used.

In [1065]:
 MarksInformation['DataMining']

0     22
1     21
2     14
3     20
4     23
5     22
6     23
7     24
8     12
9     15
10    18
11    17
Name: DataMining, dtype: int64

In [1066]:
MarksInformation['DataMining'].mode()

0    22
1    23
Name: DataMining, dtype: int64

**Calculating Quartile**

Dataframe.quantile() is used to get the quartiles. It
will output the quartile of each column or row of the
DataFrame in four parts i.e. the first quartile is 25%
(parameter q = .25), the second quartile is 50% (Median),
the third quartile is 75% (parameter q = .75). By default,
it will display the second quantile (median) of all
numeric values.

In [1067]:
 MarksInformation.quantile(numeric_only=True)

UnitTest            2.0
DataMining         20.5
AI                 19.5
Graphics           20.0
ImageProcessing    22.5
Cryptography       21.5
Name: 0.5, dtype: float64

 By default, median is the
output

In [1068]:
MarksInformation.quantile(numeric_only=True,q=.25)

UnitTest            1.00
DataMining         16.50
AI                 18.00
Graphics           18.75
ImageProcessing    20.75
Cryptography       19.75
Name: 0.25, dtype: float64

In [1069]:
MarksInformation.quantile(numeric_only=True,q=.75)

UnitTest            3.00
DataMining         22.25
AI                 21.25
Graphics           22.50
ImageProcessing    24.00
Cryptography       23.00
Name: 0.75, dtype: float64

**Write the statement to display the first and
third quartiles of all subjects.**

In [1070]:
Subjects=MarksInformation[['DataMining','AI','Graphics','ImageProcessing','Cryptography']]
print("Marks of all the subjects:\n\n")
Subjects

Marks of all the subjects:

    DataMining  AI  Graphics  ImageProcessing  Cryptography
0           22  21        18               20            21
1           21  20        17               22            24
2           14  19        15               24            23
3           20  17        22               24            19
4           23  15        21               25            15
5           22  18        19               23            13
6           23  19        20               15            22
7           24  22        24               17            21
8           12  25        19               21            23
9           15  22        25               22            22
10          18  21        25               24            23
11          17  18        20               25            20

In [1071]:
Quartiles=Subjects.quantile([.25,.75])
print("First and third quartiles of all the subjects:\n\n")
Quartiles

First and third quartiles of all the subjects:

      DataMining     AI  Graphics  ImageProcessing  Cryptography
0.25       16.50  18.00     18.75            20.75         19.75
0.75       22.25  21.25     22.50            24.00         23.00

**Calculating Variance**

DataFrame.var() is used to display the variance. It is the
average of squared differences from the mean.

In [1072]:
 MarksInformation[['DataMining','AI','Graphics','ImageProcessing','Cryptography']].var()

DataMining         15.840909
AI                  7.113636
Graphics            9.901515
ImageProcessing     9.969697
Cryptography       11.363636
dtype: float64

**Calculating Standard Deviation**

DataFrame.std() returns the standard deviation of the
values. Standard deviation is calculated as the square
root of the variance.

In [1073]:
  MarksInformation[['DataMining','AI','Graphics','ImageProcessing','Cryptography']].std()

DataMining         3.980064
AI                 2.667140
Graphics           3.146667
ImageProcessing    3.157483
Cryptography       3.370999
dtype: float64

DataFrame.describe() function displays the
descriptive statistical values in a single command. These
values help us describe a set of data in a DataFrame.

In [1074]:
MarksInformation.describe()

,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
count,12.000000,12.000000,12.00000,12.000000,12.000000,12.000000
mean,2.000000,19.250000,19.75000,20.416667,21.833333,20.500000
std,0.852803,3.980064,2.66714,3.146667,3.157483,3.370999
min,1.000000,12.000000,15.00000,15.000000,15.000000,13.000000
25%,1.000000,16.500000,18.00000,18.750000,20.750000,19.750000
50%,2.000000,20.500000,19.50000,20.000000,22.500000,21.500000
75%,3.000000,22.250000,21.25000,22.500000,24.000000,23.000000
max,3.000000,24.000000,25.00000,25.000000,25.000000,24.000000

**Data Aggregations**

Aggregation means to transform the dataset and produce
a single numeric value from an array. Aggregation can
be applied to one or more columns together. Aggregate
functions are max(),min(), sum(), count(), std(), var().

In [1075]:
MarksInformation.aggregate('max')

Name               Suci
UnitTest              3
DataMining           24
AI                   25
Graphics             25
ImageProcessing      25
Cryptography         24
dtype: object

To use multiple aggregate functions in a
single statement

In [1076]:
 MarksInformation.aggregate(['max','count'])

       Name  UnitTest  DataMining  AI  Graphics  ImageProcessing  Cryptography
max    Suci         3          24  25        25               25            24
count    12        12          12  12        12               12            12

In [1077]:
 MarksInformation['DataMining'].aggregate(['max','min'])

max    24
min    12
Name: DataMining, dtype: int64

We can also use the parameter axis with
aggregate function. By default, the value of axis is zero,
means columns

Using the above statement with axis=0 gives
the same result

In [1078]:
MarksInformation['DataMining'].aggregate(['max','min'],axis=0)

max    24
min    12
Name: DataMining, dtype: int64

In [1079]:
MarksInformation[['DataMining','AI']].aggregate('sum',axis=1)

0     43
1     41
2     33
3     37
4     38
5     40
6     42
7     46
8     37
9     37
10    39
11    35
dtype: int64

**Sorting a DataFrame**

By default, sorting is done in ascending order.

In [1080]:
MarksInformation.sort_values(by=['Name'])

,Name,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
6,Ashravy,1,23,19,20,15,22
7,Ashravy,2,24,22,24,17,21
8,Ashravy,3,12,25,19,21,23
9,Mishti,1,15,22,25,22,22
10,Mishti,2,18,21,25,24,23
11,Mishti,3,17,18,20,25,20
3,Srabanti,1,20,17,22,24,19
4,Srabanti,2,23,15,21,25,15
5,Srabanti,3,22,18,19,23,13
0,Suci,1,22,21,18,20,21
1,Suci,2,21,20,17,22,24
2,Suci,3,14,19,15,24,23

Now, to obtain sorted list of marks scored by all
students in Science in Unit Test 2, the following code
can be used:

In [1081]:
test2 = MarksInformation[MarksInformation.UnitTest== 2]
test2

,Name,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
1,Suci,2,21,20,17,22,24
4,Srabanti,2,23,15,21,25,15
7,Ashravy,2,24,22,24,17,21
10,Mishti,2,18,21,25,24,23

In [1082]:
test2.sort_values(by=['DataMining'])

,Name,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
10,Mishti,2,18,21,25,24,23
1,Suci,2,21,20,17,22,24
4,Srabanti,2,23,15,21,25,15
7,Ashravy,2,24,22,24,17,21

Write the statement which will sort the
marks in English in the DataFrame df
based on Unit Test 3, in descending order

In [1083]:
UnitTest3 =  MarksInformation[MarksInformation.UnitTest == 3]
UnitTest3

,Name,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
2,Suci,3,14,19,15,24,23
5,Srabanti,3,22,18,19,23,13
8,Ashravy,3,12,25,19,21,23
11,Mishti,3,17,18,20,25,20

Sort according to descending order of marks in
Science

In [1084]:
UnitTest3.sort_values(by=['AI'],ascending=False)

,Name,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
8,Ashravy,3,12,25,19,21,23
2,Suci,3,14,19,15,24,23
5,Srabanti,3,22,18,19,23,13
11,Mishti,3,17,18,20,25,20

A DataFrame can be sorted based on multiple
columns. Following is the code of sorting the DataFrame
df based on marks in Science in Unit Test 3 in ascending
order. If marks in Science are the same, then sorting
will be done on the basis of marks in Hindi

 Get the data corresponding to marks in Unit Test 3

In [1085]:
UnitTest3 =  MarksInformation[MarksInformation.UnitTest == 3]

 Sort the data according to Science and then
according to Hindi

In [1086]:
 UnitTest3.sort_values(by=['AI','ImageProcessing'])

,Name,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
5,Srabanti,3,22,18,19,23,13
11,Mishti,3,17,18,20,25,20
2,Suci,3,14,19,15,24,23
8,Ashravy,3,12,25,19,21,23

Here, we can see that the list is sorted on the basis
of marks in Science. Two students namely, Srabanti and
Mishti have equal marks (18) in Science. Therefore for
them, sorting is done on the basis of marks in ImageProcessing.

**GROUP BY FUNCTIONS**

In pandas, DataFrame.GROUP BY() function is used
to split the data into groups based on some criteria.
Pandas objects like a DataFrame can be split on any
of their axes. The GROUP BY function works based on
a split-apply-combine strategy which is shown below
using a 3-step process:

Step 1: Split the data into groups by creating a GROUP
BY object from the original DataFrame.

Step 2: Apply the required function.

Step 3: Combine the results to form a new DataFrame.

**Create a GROUP BY Name of the student from
DataFrame MarksInformation**

In [1087]:
group=MarksInformation.groupby('Name')
group

Displaying the first entry from each group

In [1088]:
 group.first()

          UnitTest  DataMining  AI  Graphics  ImageProcessing  Cryptography
Name
Ashravy          1          23  19        20               15            22
Mishti           1          15  22        25               22            22
Srabanti         1          20  17        22               24            19
Suci             1          22  21        18               20            21

In [1089]:
group.size()

Name
Ashravy     3
Mishti      3
Srabanti    3
Suci        3
dtype: int64

Displaying group data, i.e., group_name, row
indexes corresponding to the group and their
data type

In [1090]:
group.groups

{'Ashravy': [6, 7, 8], 'Mishti': [9, 10, 11], 'Srabanti': [3, 4, 5], 'Suci': [0, 1, 2]}

Printing data of a single group

In [1091]:
group.get_group('Suci')

   Name  UnitTest  DataMining  AI  Graphics  ImageProcessing  Cryptography
0  Suci         1          22  21        18               20            21
1  Suci         2          21  20        17               22            24
2  Suci         3          14  19        15               24            23

Grouping with respect to multiple attributes.
Creating a GROUP BY Name and UT

In [1092]:
group2=MarksInformation.groupby(['Name', 'UnitTest'])

In [1093]:
group2.first()

                   DataMining  AI  Graphics  ImageProcessing  Cryptography
Name     UnitTest
Ashravy  1                 23  19        20               15            22
         2                 24  22        24               17            21
         3                 12  25        19               21            23
Mishti   1                 15  22        25               22            22
         2                 18  21        25               24            23
         3                 17  18        20               25            20
Srabanti 1                 20  17        22               24            19
         2                 23  15        21               25            15
         3                 22  18        19               23            13
Suci     1                 22  21        18               20            21
         2                 21  20        17               22            24
         3                 14  19        15               24            23

The above statements show how we create groups by
splitting a DataFrame using GROUP BY(). Next step is
to apply functions over the groups just created. This is
done using Aggregation.
Aggregation is a process in which an aggregate
function is applied on each group created by GROUP
BY(). It returns a single aggregated statistical value
corresponding to each group. It can be used to apply
multiple functions over an axis. Be default, functions
are applied over columns. Aggregation can be performed
using agg() or aggregate() function.

Calculating average marks scored by all
students in each subject for each Unit Test

In [1094]:
group3=MarksInformation.groupby('UnitTest')

In [1095]:

MarksInformation.groupby('UnitTest').agg({'DataMining':'mean','AI':'mean','Graphics':'mean','ImageProcessing':'mean','Cryptography':'mean'})

          DataMining     AI  Graphics  ImageProcessing  Cryptography
UnitTest
1              20.00  19.75     21.25            20.25         21.00
2              21.50  19.50     21.75            22.00         20.75
3              16.25  20.00     18.25            23.25         19.75

Calculate average marks scored in DataMining in
each UnitTest

In [1096]:
MarksInformation.groupby('UnitTest').agg({'DataMining':'mean'})

          DataMining
UnitTest
1              20.00
2              21.50
3              16.25

**Write the python statements to print the
mean, variance, standard deviation and
quartile of the marks scored in DataMining
by each student across the UnitTest**

In [1097]:
MarksInformation.groupby('Name').agg({'DataMining':['mean','var','std','quantile']})

         DataMining
               mean        var       std quantile
Name
Ashravy   19.666667  44.333333  6.658328     23.0
Mishti    16.666667   2.333333  1.527525     17.0
Srabanti  21.666667   2.333333  1.527525     22.0
Suci      19.000000  19.000000  4.358899     21.0

**Altering the Index**

We use indexing to access the elements of a DataFrame.
It is used for fast retrieval of data. By default, a numeric
index starting from 0 is created as a row index, as shown
below:

In [1098]:
MarksInformation

,Name,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
0,Suci,1,22,21,18,20,21
1,Suci,2,21,20,17,22,24
2,Suci,3,14,19,15,24,23
3,Srabanti,1,20,17,22,24,19
4,Srabanti,2,23,15,21,25,15
5,Srabanti,3,22,18,19,23,13
6,Ashravy,1,23,19,20,15,22
7,Ashravy,2,24,22,24,17,21
8,Ashravy,3,12,25,19,21,23
9,Mishti,1,15,22,25,22,22
10,Mishti,2,18,21,25,24,23
11,Mishti,3,17,18,20,25,20

When we slice the data, we get the original index
which is not continuous, e.g. when we select marks of
all students in Unit Test 1, we get the following result:

In [1099]:
UnitTest1 = MarksInformation[MarksInformation.UnitTest == 1]
UnitTest1

       Name  UnitTest  DataMining  AI  Graphics  ImageProcessing  Cryptography
0      Suci         1          22  21        18               20            21
3  Srabanti         1          20  17        22               24            19
6   Ashravy         1          23  19        20               15            22
9    Mishti         1          15  22        25               22            22

Notice that the first column is a non-continuous
index since it is slicing of original data. We create a new
continuous index alongside this using the reset_index()
function, as shown below:

In [1100]:
UnitTest1 = MarksInformation[MarksInformation.UnitTest == 1]
UnitTest1.reset_index(inplace=True)
UnitTest1

,index,Name,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
0,0,Suci,1,22,21,18,20,21
1,3,Srabanti,1,20,17,22,24,19
2,6,Ashravy,1,23,19,20,15,22
3,9,Mishti,1,15,22,25,22,22

We can change the index to some other column of
the data

In [1101]:
UnitTest1.set_index('Name',inplace=True)
UnitTest1

,index,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
Name,,,,,,,
Suci,0,1,22,21,18,20,21
Srabanti,3,1,20,17,22,24,19
Ashravy,6,1,23,19,20,15,22
Mishti,9,1,15,22,25,22,22

We can revert back to previous index by using
following statement:

In [1102]:
UnitTest1.reset_index('Name', inplace = True)
UnitTest1

,Name,index,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
0,Suci,0,1,22,21,18,20,21
1,Srabanti,3,1,20,17,22,24,19
2,Ashravy,6,1,23,19,20,15,22
3,Mishti,9,1,15,22,25,22,22

**Other DataFrame Operations**

**1.Reshaping Data**

**(A) Pivot**

The pivot function is used to reshape and create a new
DataFrame from the original one. Consider the following
example of sales and profit data of four stores: S1, S2,
S3 and S4 for the years 2016, 2017 and 2018.

In [1103]:
data={'Store':['Boi Bichitra','Pathak Shamabesh','Puthighar','Boi Bichitra','Muktodhara','Puthighar','Boi Bichitra','Muktodhara','Puthighar'],
      'Year':[2016,2016,2016,2017,2017,2017,2018,2018,2018],
      'Total_sales(TK)':[12000,330000,420000,20000,10000,450000,30000, 11000,89000],
      'Total_profit(TK)':[1100,5500,21000,32000,9000,45000,3000,1900,23000]
}

In [1104]:
Transaction=pd.DataFrame(data)
Transaction

              Store  Year  Total_sales(TK)  Total_profit(TK)
0      Boi Bichitra  2016            12000              1100
1  Pathak Shamabesh  2016           330000              5500
2         Puthighar  2016           420000             21000
3      Boi Bichitra  2017            20000             32000
4        Muktodhara  2017            10000              9000
5         Puthighar  2017           450000             45000
6      Boi Bichitra  2018            30000              3000
7        Muktodhara  2018            11000              1900
8         Puthighar  2018            89000             23000

Let us try to answer the following queries on the
above data.

**1) What was the total sale of store Boi Bichitra in all the years?
Python statements to perform this task will be
as follows:**

In [1105]:

Store1 = Transaction[Transaction.Store=='Boi Bichitra']
Store1

          Store  Year  Total_sales(TK)  Total_profit(TK)
0  Boi Bichitra  2016            12000              1100
3  Boi Bichitra  2017            20000             32000
6  Boi Bichitra  2018            30000              3000

In [1106]:
Store1['Total_sales(TK)'].sum()

62000

**2) What is the maximum sale value by store Puthighar in
any year?**

In [1107]:

Store3 = Transaction[Transaction.Store=='Puthighar']
Store3

       Store  Year  Total_sales(TK)  Total_profit(TK)
2  Puthighar  2016           420000             21000
5  Puthighar  2017           450000             45000
8  Puthighar  2018            89000             23000

In [1108]:
Store3['Total_sales(TK)'].max()

450000

**3) Which store had the maximum total sale in all
the years?**

In [1109]:
Store1= Transaction[Transaction.Store=='Boi Bichitra']
Store1

          Store  Year  Total_sales(TK)  Total_profit(TK)
0  Boi Bichitra  2016            12000              1100
3  Boi Bichitra  2017            20000             32000
6  Boi Bichitra  2018            30000              3000

In [1110]:
Store2=Transaction[Transaction.Store=='Muktodhara']
Store2

        Store  Year  Total_sales(TK)  Total_profit(TK)
4  Muktodhara  2017            10000              9000
7  Muktodhara  2018            11000              1900

In [1111]:
Store3 = Transaction[Transaction.Store=='Puthighar']
Store3

       Store  Year  Total_sales(TK)  Total_profit(TK)
2  Puthighar  2016           420000             21000
5  Puthighar  2017           450000             45000
8  Puthighar  2018            89000             23000

In [1112]:
Store4 = Transaction[Transaction.Store=='Pathak Shamabesh']
Store4

              Store  Year  Total_sales(TK)  Total_profit(TK)
1  Pathak Shamabesh  2016           330000              5500

In [1113]:
Store1Total = Store1['Total_sales(TK)'].sum()
Store1Total

62000

In [1114]:
Store2Total = Store2['Total_sales(TK)'].sum()
Store2Total

21000

In [1115]:
Store3Total = Store3['Total_sales(TK)'].sum()
Store3Total

959000

In [1116]:
Store4Total = Store4['Total_sales(TK)'].sum()
Store4Total

330000

In [1117]:
max(Store1Total,Store2Total,Store3Total,Store4Total)

959000

**Notice that we have to slice the data corresponding to
a particular store and then answer the query. Now, let
us reshape the data using pivot and see the difference.**

In [1118]:
pivot1=Transaction.pivot(index='Store',columns='Year',values='Total_sales(TK)')
pivot1

Year                  2016      2017     2018
Store
Boi Bichitra       12000.0   20000.0  30000.0
Muktodhara             NaN   10000.0  11000.0
Pathak Shamabesh  330000.0       NaN      NaN
Puthighar         420000.0  450000.0  89000.0

As can be seen above, the value of Total_sales (Rs)
for every row in the original table has been transferred
to the new table: pivot1, where each row has data of a
store and each column has data of a year. Those cells in
the new pivot table which do not have a matching entry
in the original one are filled with NaN. For instance, we
did not have values corresponding to sales of Store S2
in 2016, thus the appropriate cell in pivot1 is filled with
NaN.

**1) What was the total sale of store S1 in all the years?**

In [1119]:
 pivot1.loc['Boi Bichitra'].sum()

62000.0

**2) What is the maximum sale value by store S3 in
any year?**

In [1120]:
 pivot1.loc['Puthighar'].max()

450000.0

**3.Which store had the maximum total sale?**

In [1121]:
Store1Total = pivot1.loc['Boi Bichitra'].sum()
Store1Total

62000.0

In [1122]:
Store2Total = pivot1.loc['Muktodhara'].sum()
Store2Total

21000.0

In [1123]:
Store3Total = pivot1.loc['Puthighar'].sum()
Store3Total

959000.0

In [1124]:
Store4Total = pivot1.loc['Pathak Shamabesh'].sum()
Store4Total

330000.0

In [1125]:
max(Store1Total,Store2Total,Store3Total,Store4Total)

959000.0

**(B) Pivoting by Multiple Columns**

In [1126]:
pivot2=Transaction.pivot(index='Store',columns='Year',values=['Total_sales(TK)','Total_profit(TK)'])
pivot2

                 Total_sales(TK)                    Total_profit(TK)           \
Year                        2016      2017     2018             2016     2017
Store
Boi Bichitra             12000.0   20000.0  30000.0           1100.0  32000.0
Muktodhara                   NaN   10000.0  11000.0              NaN   9000.0
Pathak Shamabesh        330000.0       NaN      NaN           5500.0      NaN
Puthighar               420000.0  450000.0  89000.0          21000.0  45000.0


Year                 2018
Store
Boi Bichitra       3000.0
Muktodhara         1900.0
Pathak Shamabesh      NaN
Puthighar         23000.0

Let us consider another example, where suppose we
have stock data corresponding to a store as:

In [1127]:
data={'Item':['Pen','Pen','Pencil','Pencil'
,'Pen','Pen'],
'Color':['Red','Red','Black','Black','Blue','Blue'],
'Price(TK)':[10,25,7,5,50,20],
'Units_in_stock':[50,10,47,34,55,14]
}

In [1128]:
Stock=pd.DataFrame(data)
Stock

     Item  Color  Price(TK)  Units_in_stock
0     Pen    Red         10              50
1     Pen    Red         25              10
2  Pencil  Black          7              47
3  Pencil  Black          5              34
4     Pen   Blue         50              55
5     Pen   Blue         20              14

Now, let us assume, we have to reshape the above
table with Item as the index and Color as the column.
We will use pivot function as given below:

pivot3=Stock.pivot(index='Item',columns='Color',values='Units_in_stock')

But this statement results in an error: “ValueError:
Index contains duplicate entries, cannot reshape”. This
is because duplicate data can’t be reshaped using pivot
function. Hence, before calling the pivot() function, we
need to ensure that our data do not have rows with
duplicate values for the specified columns. If we can’t
ensure this, we may have to use pivot_table function
instead.

**(C) Pivot Table**

It works like a pivot function, but aggregates the values
from rows with duplicate entries for the specified
columns. In other words, we can use aggregate functions
like min, max, mean etc, wherever we have duplicate
entries. The default aggregate function is mean.

In [1129]:
Stock1 = Stock.pivot_table(index=['Item','Color'])
Stock1

              Price(TK)  Units_in_stock
Item   Color
Pen    Blue        35.0            34.5
       Red         17.5            30.0
Pencil Black        6.0            40.5

In [1130]:
import warnings
warnings.filterwarnings('ignore')

Mean has been used as the default
aggregate function. Price of the blue pen in the original
data is 50 and 20. Mean has been used as aggregate
and the price of the blue pen is 35 in df1.
We can use multiple aggregate functions on the
data. Below example shows the use of the sum, max
and np.mean function.

In [1131]:
import numpy as np
pivot_table1=Stock.pivot_table(index='Item',columns='Color',values='Units_in_stock',aggfunc=[sum,max,np.mean])
pivot_table1

         sum               max              mean
Color  Black  Blue   Red Black  Blue   Red Black  Blue   Red
Item
Pen      NaN  69.0  60.0   NaN  55.0  50.0   NaN  34.5  30.0
Pencil  81.0   NaN   NaN  47.0   NaN   NaN  40.5   NaN   NaN

Pivoting can also be done on multiple columns.
Further, different aggregate functions can be applied on
different columns. The following example demonstrates
pivoting on two columns - Price(Rs) and Units_in_stock.
Also, the application of len() function on the column
Price(Rs) and mean() function of column Units_in_
stock is shown in the example. Note that the aggregate
function len returns the number of rows corresponding
to that entry.

In [1132]:
pivot_table2=Stock.pivot_table(index='Item',columns='Color',values=['Price(TK)','Units_in_stock'],aggfunc={"Price(TK)":len,"Units_in_stock":np.mean})
pivot_table2

       Price(TK)           Units_in_stock
Color      Black Blue  Red          Black  Blue   Red
Item
Pen          NaN  2.0  2.0            NaN  34.5  30.0
Pencil       2.0  NaN  NaN           40.5   NaN   NaN

**Write the statement to print the maximum
price of pen of each color.**

In [1133]:
pen=Stock[Stock.Item=='Pen']
pen

  Item Color  Price(TK)  Units_in_stock
0  Pen   Red         10              50
1  Pen   Red         25              10
4  Pen  Blue         50              55
5  Pen  Blue         20              14

In [1134]:
redpen=pen.pivot_table(index='Item',columns=['Color'],values=['Price(TK)'],aggfunc=[max])
redpen

            max
      Price(TK)
Color      Blue Red
Item
Pen          50  25

**Handling Missing Values**

Missing values create a lot of problems during data
analysis and have to be handled properly. The two
most common strategies for handling missing values
explained in this section are:
i) drop the object having missing values,
ii) fill or estimate the missing value

**1.Checking Missing Values**

In [1135]:
 marks = {
'Name':['Suci','Suci','Suci','Srabanti','Srabanti','Srabanti', 'Ashravy','Ashravy','Ashravy','Mishti','Mishti','Mishti'],
 'UnitTest':[1,2,3,1,2,3,1,2,3,1,2,3],
 'DataMining':[22,21,14,20,23,22,23,24,12,15,18,17],
 'AI':[20,np.NaN,19,17,15,18,19,22,np.NaN,22,21,18],
 'Graphics':[18,17,15,22,21,19,20,24,19,25,25,20],
 'ImageProcessing':[20,22,24,24,25,23,15,np.NaN,21,22,24,25],
 'Cryptography':[24,np.NaN,23,19,15,13,22,21,23,22,23,np.NaN] }
Marks = pd.DataFrame(marks)
Marks

,Name,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
0,Suci,1,22,20.0,18,20.0,24.0
1,Suci,2,21,NaN,17,22.0,NaN
2,Suci,3,14,19.0,15,24.0,23.0
3,Srabanti,1,20,17.0,22,24.0,19.0
4,Srabanti,2,23,15.0,21,25.0,15.0
5,Srabanti,3,22,18.0,19,23.0,13.0
6,Ashravy,1,23,19.0,20,15.0,22.0
7,Ashravy,2,24,22.0,24,NaN,21.0
8,Ashravy,3,12,NaN,19,21.0,23.0
9,Mishti,1,15,22.0,25,22.0,22.0
10,Mishti,2,18,21.0,25,24.0,23.0
11,Mishti,3,17,18.0,20,25.0,NaN

In [1136]:
Marks.isnull()

,Name,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
0,False,False,False,False,False,False,False
1,False,False,False,True,False,False,True
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False
7,False,False,False,False,False,True,False
8,False,False,False,True,False,False,False
9,False,False,False,False,False,False,False
10,False,False,False,False,False,False,False
11,False,False,False,False,False,False,True

One can check for each individual attribute also,
e.g. the following statement checks whether attribute
‘Science’ has a missing value or not. It returns True for
each row where there is a missing value for attribute
‘Science’, and False otherwise.

In [1137]:
Marks['AI'].isnull()

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9     False
10    False
11    False
Name: AI, dtype: bool

To check whether a column (attribute) has a missing
value in the entire dataset, any() function is used. It
returns True in case of missing value else returns False.

In [1138]:
Marks['AI'].isnull().any()

True

In [1139]:
Marks['DataMining'].isnull().any()

False

To find the number of NaN values corresponding to
each attribute, one can use the sum() function along
with isnull() function, as shown below:

In [1140]:
Marks.isnull().sum()

Name               0
UnitTest           0
DataMining         0
AI                 2
Graphics           0
ImageProcessing    1
Cryptography       2
dtype: int64

To find the total number of NaN in the whole dataset,
one can use df.isnull().sum().sum().

In [1141]:
Marks.isnull().sum().sum()

5

**Write a program to find the percentage of
marks scored by Suci in DataMining.**

In [1142]:
Suci = Marks[Marks['Name']=='Suci']
print('Marks Scored by Suci')
Suci

Marks Scored by Suci

   Name  UnitTest  DataMining    AI  Graphics  ImageProcessing  Cryptography
0  Suci         1          22  20.0        18             20.0          24.0
1  Suci         2          21   NaN        17             22.0           NaN
2  Suci         3          14  19.0        15             24.0          23.0

In [1143]:
DataMining = Suci['DataMining']
print("Marks Scored by Suci in DataMining")
DataMining

Marks Scored by Suci in DataMining

0    22
1    21
2    14
Name: DataMining, dtype: int64

In [1144]:
row = len(DataMining) # Number of Unit Testsheld. Here row will be 4

In [1145]:
row

3

In [1146]:
print("Percentage of Marks Scored by Suci in DataMining\n\n",(DataMining.sum()*100)/(25*row),"%")

Percentage of Marks Scored by Suci in DataMining

 76.0 %

**Write a python program to find the
percentage of marks obtained by Suci
in Cryptography subject.**

In [1147]:
AI = Suci['AI']
print("Marks Scored by Suci in Cryptography")
AI

Marks Scored by Suci in Cryptography

0    20.0
1     NaN
2    19.0
Name: AI, dtype: float64

In [1148]:
row = len(AI) # here, row will be 4,the number of Unit Tests
row

3

In [1149]:
print("Percentage of Marks Scored by Suci in AI\n\n", AI.sum()*100/(25*row),"%")

Percentage of Marks Scored by Suci in AI

 52.0 %

Here, notice that Raman was absent in Unit Test 4 in
Maths Subject. While computing the percentage, marks
of the fourth test have been considered as 0.

**2.Dropping Missing Values**

In [1150]:
Marks1 = Marks.dropna()
Marks1

,Name,UnitTest,DataMining,AI,Graphics,ImageProcessing,Cryptography
0,Suci,1,22,20.0,18,20.0,24.0
2,Suci,3,14,19.0,15,24.0,23.0
3,Srabanti,1,20,17.0,22,24.0,19.0
4,Srabanti,2,23,15.0,21,25.0,15.0
5,Srabanti,3,22,18.0,19,23.0,13.0
6,Ashravy,1,23,19.0,20,15.0,22.0
9,Mishti,1,15,22.0,25,22.0,22.0
10,Mishti,2,18,21.0,25,24.0,23.0

Now, let us consider the following code:

In [1151]:
# marks obtained by Raman in all the unit tests
Suci=Marks[Marks.Name=='Suci']
Suci

   Name  UnitTest  DataMining    AI  Graphics  ImageProcessing  Cryptography
0  Suci         1          22  20.0        18             20.0          24.0
1  Suci         2          21   NaN        17             22.0           NaN
2  Suci         3          14  19.0        15             24.0          23.0

In [1152]:
AI = Suci['AI']

In [1153]:
print("\nMarks Scored by Suci in AI\n")
AI

Marks Scored by Suci in AI

0    20.0
1     NaN
2    19.0
Name: AI, dtype: float64

In [1154]:
row = len(AI)
print("\nPercentage of Marks Scored by Suci in AI\n")
print(AI.sum()*100/(25*row),"%")

Percentage of Marks Scored by Suci in AI

52.0 %

In [1155]:
Suci1=Suci.dropna(axis=0)

In [1156]:
AI = Suci1['AI']

In [1157]:
row = len(AI)
print("\nPercentage of Marks Scored by Suci in AI\n")
print(AI.sum()*100/(25*row),"%")

Percentage of Marks Scored by Suci in AI

78.0 %

**3.Estimating Missing Values**

Missing values can be filled by using estimations or
approximations e.g a value just before (or after) the
missing value, average/minimum/maximum of the
values of that attribute, etc. In some cases, missing
values are replaced by zeros (or ones).
The fillna(num) function can be used to replace
missing value(s) by the value specified in num. For
example, fillna(0) replaces missing value by 0. Similarly
fillna(1) replaces missing value by 1. Following code
replaces missing values by 0 and computes the
percentage of marks scored by Raman in Science.

In [1158]:
#Marks Scored by Suci in all the subjects across the tests
Suci = Marks.loc[Marks['Name']=='Suci']
Suci

   Name  UnitTest  DataMining    AI  Graphics  ImageProcessing  Cryptography
0  Suci         1          22  20.0        18             20.0          24.0
1  Suci         2          21   NaN        17             22.0           NaN
2  Suci         3          14  19.0        15             24.0          23.0

In [1159]:
(row,col) =Suci.shape
(row,col)

(3, 7)

In [1160]:
AI = Suci.loc[:,'AI']
print("Marks Scored by Suci in AI")
AI

Marks Scored by Suci in AI

0    20.0
1     NaN
2    19.0
Name: AI, dtype: float64

In [1161]:
FillZeroAI = AI.fillna(0)
print('\nMarks Scored by Suci in AI with Missing Values Replaced with Zero')
FillZeroAI

Marks Scored by Suci in AI with Missing Values Replaced with Zero

0    20.0
1     0.0
2    19.0
Name: AI, dtype: float64

In [1162]:
print("Percentage of Marks Scored by Raman in Science\n\n",FillZeroAI.sum()*100/(25*row),"%")

Percentage of Marks Scored by Raman in Science

 52.0 %

df.fillna(method='pad') replaces the missing
value by the value before the missing value while
df.fillna(method='bfill') replaces the missing value by the
value after the missing value. Following code replaces
the missing value of Cryptography then computes the percentage
of marks obtained by Suci.

In [1163]:
Cryptography = Suci.loc[:,'Cryptography']
print("Marks Scored by Suci in Cryptography")
Cryptography

Marks Scored by Suci in Cryptography

0    24.0
1     NaN
2    23.0
Name: Cryptography, dtype: float64

In [1164]:
FillPadCryptography = Cryptography.fillna(method='pad')
print('\nMarks Scored by Suci in Cryptography with Missing Values Replaced by Previous TestMarks')
FillPadCryptography

Marks Scored by Suci in Cryptography with Missing Values Replaced by Previous TestMarks

0    24.0
1    24.0
2    23.0
Name: Cryptography, dtype: float64

In [1165]:
row = len(Cryptography)

In [1166]:
print("Percentage of Marks Scored by Suci in Cryptography")
print(FillPadCryptography.sum()*100/(25*row),"%")

Percentage of Marks Scored by Suci in Cryptography
94.66666666666667 %

**END**